[
  {
    "id": "20caf138-0c81-4ef9-be60-fe919e0d68d4",
    "question": "steve jobs statue location budapst",
    "expected_answer": "The Steve Jobs statue is located in Budapest, Hungary.",
    "category": "Arts",
    "area": "Knowledge"
  },
  {
    "id": "1f37d9fd-1bcc-4f79-b004-bc0e1e944033",
    "question": "Why is the Battle of Stalingrad considered a turning point in World War II?",
    "expected_answer": "The Battle of Stalingrad is considered a turning point in World War II because it marked the first major defeat of the German army, which shattered the myth of their invincibility. It halted the German advance into the Soviet Union and began a series of Soviet offensives that would eventually push the Germans back to Berlin. The battle also had significant psychological and strategic impacts, boosting Soviet morale and weakening German resolve.",
    "category": "General News",
    "area": "News"
  },
  {
    "id": "76173a7f-d645-4e3e-8e0d-cca139e00ebe",
    "question": "In what year did 'The Birth of a Nation' surpass 'Gone with the Wind' as the highest-grossing film of all time, adjusting for inflation?",
    "expected_answer": "This question is based on a false premise. 'The Birth of a Nation' (1915) could not have surpassed 'Gone with the Wind' (1939) as the highest-grossing film of all time because 'Gone with the Wind' was released later and held the record for many years after its release. 'The Birth of a Nation' was indeed a major box office success in its time, but it predates 'Gone with the Wind' by over two decades. The question incorrectly assumes that 'The Birth of a Nation' could have overtaken 'Gone with the Wind' at some point, which is not possible given the chronology of their releases and the historical box office data available.",
    "category": "Entertainment",
    "area": "News"
  },
  {
    "id": "5f5ef4ca-91fe-4610-a8a9-e15b12e3c803",
    "question": "How many Russian soldiers surrendered to AFU in Kursk region?",
    "expected_answer": "About 300 Russian soldiers surrendered to the Armed Forces of Ukraine (AFU) in the Kursk region.",
    "category": "General News",
    "area": "News"
  },
  {
    "id": "64dbed0d-d91b-4acd-9a9c-0a7aa83115ec",
    "question": "What event led to the creation of Google Images?",
    "expected_answer": "Jennifer Lopez's appearance in a green Versace dress at the 2000 Grammy Awards led to the creation of Google Images.",
    "category": "Technology",
    "area": "News"
  }
]